       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello_10_times.
       PROCEDURE DIVISION.
       PERFORM 10 TIMES
          DISPLAY "Hello"
       END-PERFORM
       STOP RUN.
      