       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello 10 times.
       PROCEDURE DIVISION.
       PERFORM 10 TIMES
          DISPLAY "Hello"
       END-PERFORM
       STOP RUN.